In [1]:
import pandas as pd
import numpy as np
import os
import re
from IPython.display import display
# os.listdir('../../txtPuro')

In [387]:
pefin = ['SERASA-R114892.txt','SERASA-R798713.txt']
refin = ['SERASA-R2794720.txt']

In [190]:
text = ""
with open('../../txtPuro/SERASA-R1109513.txt') as infile:
    for line in infile:
        text += line

In [191]:
# print(table_columns)
# print(split_line)
# # print(split_column)
# print('"',split_space,'"')
# # print(print_table)

In [192]:
table_columns = ['DATA','MODALIDADE','VALOR','TITULO','INST.COBRADORA','LOCAL']

In [194]:
def type_txt_detect(name):
    vector_aux = text[text.find(name):].split('\n')
    vector_aux = np.array(vector_aux)

    table_vector = vector_aux[:np.where(vector_aux == '')[0][0]]
    print(table_vector)
    count = 0
    split_column = 0
    for i in table_vector:
        if 'ATUALIZACAO' in i:
            split_column = 1
        count+=i.count('|')

    if count < 4: return 0, split_column
    else: return 1, split_column
    
type_txt_detect(name_type)

[]

(0, 0)

In [195]:
name_type = 'HISTORICO DE PAGAMENTOS - VISAO CEDENTE'
split_space = ' '
vector_aux = text[text.find(name_type):]
vector_aux = vector_aux[:vector_aux.find('*')].split('\n')
vector_aux = np.array(vector_aux)
vector_aux = vector_aux[4:]

lines_split = np.where(vector_aux == '')[0]
# table_vector = vector_aux[:np.where(vector_aux == '')[0][2]]
table_columns= ['MES/ANO','PONTUAL_QTD','PONTUAL_%',
    '8-15_QTD','8-15_%',
    '16-30_QTD','16-30_%',
    '31-60_QTD','31-60_%',
    '+60_QTD','+60_%',
    'PMA A VISTA QTD','PMA A VISTA %','TOTAL']


df = pd.DataFrame()

for i in range(len(lines_split)):
    aux_line = vector_aux[lines_split[i]+1:lines_split[i+1]]
    if aux_line[0].count('TOTAL')>= 1:
        break
    
    data = {}
    
    data['DATA'] = aux_line[0]

    data['PONTUAL_value'] = clear_str(aux_line[1].split('|')[1].strip())
    data['PONTUAL_percent'] = clear_str(aux_line[1].split('|')[2].strip())

    data['8-15_value'] = clear_str(aux_line[2].split('|')[1].strip())
    data['8-15_percent'] = clear_str(aux_line[2].split('|')[2].strip())

    data['16-30_value'] = clear_str(aux_line[3].split('|')[1].strip())
    data['16-30_percent'] = clear_str(aux_line[3].split('|')[2].strip())

    data['31-60_value'] = clear_str(aux_line[4].split('|')[1].strip())
    data['31-60_percent'] = clear_str(aux_line[4].split('|')[2].strip())

    data['+60_value'] = clear_str(aux_line[5].split('|')[1].strip())
    data['+60_percent'] = clear_str(aux_line[5].split('|')[2].strip())

    data['A_VISTA_value'] = clear_str(aux_line[6].split('|')[1].strip())
    data['A_VISTA_percent'] = clear_str(aux_line[6].split('|')[2].strip())
    
    df = df.append(pd.DataFrame([data]), ignore_index = True)

In [196]:
df

Empty DataFrame
Columns: []
Index: []

In [184]:
def clear_str(name):
    if name.count('-') >= 1 or len(name.strip()) <= 1:
        return np.nan
    return name

In [186]:
df

,DATA,PONTUAL_value,PONTUAL_percent,8-15_value,8-15_percent,16-30_value,16-30_percent,31-60_value,31-60_percent,+60_value,+60_percent,A_VISTA_value,A_VISTA_percent
0,NOV/19,300 MIL A 400 MIL,"93,00% A 95,00%",17 MIL A 20 MIL,"3,00% A 5,00%","6,5 MIL A 7 MIL","1,00% A 3,00%",NaN,NaN,NaN,NaN,NaN,NaN
1,OUT/19,500 MIL A 600 MIL,"95,00% A 97,00%","6 MIL A 6,5 MIL","1,00% A 3,00%",10 MIL A 13 MIL,"1,00% A 3,00%","1 MIL A 1,5 MIL","0,10% A 0,20%",NaN,NaN,NaN,NaN
2,SET/19,300 MIL A 400 MIL,"97,00% A 100,00%","1,5 MIL A 2 MIL","0,40% A 1,00%","2 MIL A 2,5 MIL","0,40% A 1,00%",NaN,NaN,NaN,NaN,NaN,NaN
3,AGO/19,400 MIL A 500 MIL,"97,00% A 100,00%","7 MIL A 7,5 MIL","1,00% A 3,00%",750 A 800,"0,10% A 0,20%",NaN,NaN,NaN,NaN,NaN,NaN
4,JUL/19,200 MIL A 300 MIL,"97,00% A 100,00%","1 MIL A 1,5 MIL","0,30% A 0,40%",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,JUN/19,100 MIL A 200 MIL,"97,00% A 100,00%","2,5 MIL A 3 MIL","1,00% A 3,00%",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,MAI/19,100 MIL A 200 MIL,"95,00% A 97,00%","6 MIL A 6,5 MIL","3,00% A 5,00%",NaN,NaN,NaN,NaN,NaN,NaN,"6 MIL A 6,5 MIL",NaN
7,ABR/19,50 MIL A 70 MIL,"97,00% A 100,00%",850 A 900,"1,00% A 3,00%",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,MAR/19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,23 MIL A 25 MIL,NaN

In [111]:
date = aux_line[0]

In [128]:
pd.DataFrame([data])

,PONTUAL_value,PONTUAL_percent,8-15_value,8-15_percent,16-30_value,16-30_percent,31-60_value,31-60_percent,+60_value,+60_percent,A_VISTA_value,A_VISTA_percent
0,400 MIL A 500 MIL,"93,00% A 95,00%",-,- -,33 MIL A 35 MIL,"5,00% A 7,00%",-,- -,-,- -,-,- -

In [58]:
vector_aux[13:21]

array(['SET/19',
       'PONTUAL       C14 |400 MIL A 500 MIL      |   97,00% A 100,00%      |',
       '8-15              | -                     |      -         -        |',
       '16-30         B5  |3,5 MIL A 4 MIL        |    0,40% A   1,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C14 |400 MIL A 500 MIL      |                         |'],
      dtype='<U69')

In [29]:
np.diff(aux[0])

array([ 9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  9,  8,
       19, 20,  2,  5,  2,  2, 19,  7,  8,  2,  6,  3,  3,  7,  2,  3,  3,
        3,  6], dtype=int64)

In [23]:
vector_aux[:138]

array(['HISTORICO DE PAGAMENTOS - VISAO CEDENTE (VALORES EM R$)',
       '(ATUALIZACAO EM 22/10/2019)', 'MES/ANO', '', 'OUT/19',
       'PONTUAL       C14 |400 MIL A 500 MIL      |   97,00% A 100,00%      |',
       '8-15              | -                     |      -         -        |',
       '16-30             | -                     |      -         -        |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C14 |400 MIL A 500 MIL      |                         |',
       '', 'SET/19',
       'PONTUAL       C14 |400 MIL A 500 MIL      |   97,00% A 100,00%      |',
       '8-15              | -                     |      -         -        |',
       '16-30         B5  |3,5 MIL A 4 MIL        |    0,40% A   1,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C14 |400 MIL A 500 MIL      |                         |',
       '', 'AGO/19',
       'PONTUAL       C12 |200 MIL A 300 MIL      |   93,00% A  95,00%      |',
       '8-15              | -                     |      -         -        |',
       '16-30         B19 |13 MIL A 15 MIL        |    5,00% A   7,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C12 |200 MIL A 300 MIL      |                         |',
       '', 'JUL/19',
       'PONTUAL       C20 |1 MI A 1,5 MI          |   97,00% A 100,00%      |',
       '8-15          B15 |8,5 MIL A 9 MIL        |    0,40% A   1,00%      |',
       '16-30             | -                     |      -         -        |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA       B18 |10 MIL A 13 MIL        |      -         -        |',
       'TOTAL MES     C20 |1 MI A 1,5 MI          |                         |',
       '', 'JUN/19',
       'PONTUAL       C19 |900 MIL A 1 MI         |   95,00% A  97,00%      |',
       '8-15          C4  |37 MIL A 40 MIL        |    3,00% A   5,00%      |',
       '16-30             | -                     |      -         -        |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C19 |900 MIL A 1 MI         |                         |',
       '', 'MAI/19',
       'PONTUAL       C21 |1,5 MI A 2 MI          |   79,00% A  81,00%      |',
       '8-15          C13 |300 MIL A 400 MIL      |   15,00% A  17,00%      |',
       '16-30         C9  |50 MIL A 70 MIL        |    1,00% A   3,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60           B1  |1,5 MIL A 2 MIL        |    0,05% A   0,10%      |',
       'A VISTA       B7  |4,5 MIL A 5 MIL        |      -         -        |',
       'TOTAL MES     C22 |2 MI A 2,5 MI          |                         |',
       '', 'ABR/19',
       'PONTUAL       C19 |900 MIL A 1 MI         |   61,00% A  63,00%      |',
       '8-15          C9  |50 MIL A 70 MIL        |    3,00% A   5,00%      |',
       '16-30         C12 |200 MIL A 300 MIL      |   17,00% A  19,00%      |',
       '31-60         C12 |200 MIL A 300 MIL      |   15,00% A  17,00%      |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C20 |1 MI A 1,5 MI          |                         |',
       '', 'MAR/19',
       'PONTUAL       C20 |1 MI A 1,5 MI          |   79,00% A  81,00%      |',
       '8-15          C11 |100 MIL A 200 MIL      |    7,00% A   9,00%      |',
       '16-30         C12 |200 MIL A 300 MIL      |   11,00% A  13,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C21 |1,5 MI A 2 MI          |                         |',
       '', 'FEV/19',
       'PONTUAL       C18 |800 MIL A 900 MIL      |   89,00% A  91,00%      |',
       '8-15          C10 |70 MIL A 100 MIL       |    9,00% A  11,00%      |',
       '16-30             | -                     |      -         -        |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C19 |900 MIL A 1 MI         |                         |',
       '', 'JAN/19',
       'PONTUAL       C20 |1 MI A 1,5 MI          |   93,00% A  95,00%      |',
       '8-15          C10 |70 MIL A 100 MIL       |    3,00% A   5,00%      |',
       '16-30         B18 |10 MIL A 13 MIL        |    0,40% A   1,00%      |',
       '31-60         B1  |1,5 MIL A 2 MIL        |    0,10% A   0,20%      |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C21 |1,5 MI A 2 MI          |                         |',
       '', 'DEZ/18',
       'PONTUAL       C20 |1 MI A 1,5 MI          |   89,00% A  91,00%      |',
       '8-15          B8  |5 MIL A 5,5 MIL        |    0,30% A   0,40%      |',
       '16-30         C11 |100 MIL A 200 MIL      |    9,00% A  11,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C21 |1,5 MI A 2 MI          |                         |',
       '', 'NOV/18',
       'PONTUAL       C21 |1,5 MI A 2 MI          |   97,00% A 100,00%      |',
       '8-15          B1  |1,5 MIL A 2 MIL        |    0,05% A   0,10%      |',
       '16-30         C2  |33 MIL A 35 MIL        |    1,00% A   3,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C21 |1,5 MI A 2 MI          |                         |',
       '', 'OUT/18',
       'PONTUAL       C19 |900 MIL A 1 MI         |   95,00% A  97,00%      |',
       '8-15          C2  |33 MIL A 35 MIL        |    3,00% A   5,00%      |',
       '16-30         A24 |1 MIL A 1,5 MIL        |    0,10% A   0,20%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C20 |1 MI A 1,5 MI          |                         |',
       '', 'SET/18',
       'PONTUAL       C14 |400 MIL A 500 MIL      |   93,00% A  95,00%      |',
       '8-15              | -                     |      -         -        |',
       '16-30         C2  |33 MIL A 35 MIL        |    5,00% A   7,00%      |',
       '31-60             | -                     |      -         -        |',
       '+60               | -                     |      -         -        |',
       'A VISTA           | -                     |      -         -        |',
       'TOTAL MES     C15 |500 MIL A 600 MIL      |                         |',
       '', 'TOTAL', 'PONTUAL       D13 |10 MI A 15 MI          |',
       '8-15          C18 |800 MIL A 900 MIL      |',
       '16-30         C17 |700 MIL A 800 MIL      |',
       '31-60         C12 |200 MIL A 300 MIL      |',
       '+60           B1  |1,5 MIL A 2 MIL        |',
       'A VISTA       B20 |15 MIL A 17 MIL        |',
       'TOTAL MES     D14 |15 MI A 20 MI          |'], dtype='<U79')

In [223]:
line_aux

[array(['12/01/2019', 'DEV', '3.818', '243682913', 'SEFAZ', 'RS'],
       dtype='<U10'),
 array(['15/12/2018', 'DEV', '89.601', '243664613', 'SEFAZ', 'RS'],
       dtype='<U10'),
 array(['13/11/2018', 'DEV', '110.049', '243653190', 'SEFAZ', 'RS'],
       dtype='<U10'),
 array(['23/10/2018', 'DEV', '2.302', '243643829', 'SEFAZ', 'RS'],
       dtype='<U10'),
 array(['16/10/2018', 'DEV', '81.132', '243643632', 'SEFAZ', 'RS'],
       dtype='<U10'),
 array(['TOTAL', 'DE', 'OCORRENCIAS', '=', '46'], dtype='<U11'),
 array(['VALOR', 'TOTAL', '=', '3.592.120'], dtype='<U9')]

In [188]:
line_aux

[array(['12/01/2019 DEV             R$       3', '.',
        '818 243682913       SEFAZ RS         CAN'], dtype='<U40'),
 array(['15/12/2018 DEV             R$      89', '.',
        '601 243664613       SEFAZ RS         CAN'], dtype='<U40'),
 array(['13/11/2018 DEV             R$     110', '.',
        '049 243653190       SEFAZ RS         CAN'], dtype='<U40'),
 array(['23/10/2018 DEV             R$       2', '.',
        '302 243643829       SEFAZ RS         CAN'], dtype='<U40'),
 array(['16/10/2018 DEV             R$      81', '.',
        '132 243643632       SEFAZ RS         CAN'], dtype='<U40'),
 array(['TOTAL DE OCORRENCIAS =    46'], dtype='<U28'),
 array(['VALOR TOTAL =      3', '.', '592', '.', '120'], dtype='<U20')]

In [166]:
count

72

In [112]:
vector_aux = text[text.find(name_type):].split('\n')
vector_aux = np.array(vector_aux)

table_vector = vector_aux[:np.where(vector_aux == '')[0][0]]

table_name = table_vector[0].split('  ')[0].strip()

if len(table_columns) == 0:
    table_columns = table_vector[1+split_columns].split('  ')
    table_columns = np.array(table_columns)
    table_columns= table_columns[table_columns!='']
    table_columns = [i.strip().replace(':','') for i in table_columns]

line_aux = table_vector[2+split_line:]
line_aux = np.array(line_aux)
line_aux = line_aux[line_aux!='']
line_aux = [np.array(re.split(split_space,i)) for i in line_aux]
line_aux = [i[i!=''] for i in line_aux]

data = {i:[] for i in table_columns}
# for l in line_aux:

In [158]:
re.split('     ','asdsa asd as asd as asd as       asd       asd ')

['asdsa asd as asd as asd as', '  asd', '  asd ']

In [111]:
table_columns

['MES/ANO', 'VENCIDOS', 'A VENCER', 'TOTAL']

In [136]:
i = np.array(line_aux[0])
aux = np.array([len(j) for j in i])
i[np.where(aux >= 4)]

In [150]:
for l in range(len(line_aux)):
    i = np.array(line_aux[l])
    aux = np.array([len(j) for j in i])
    line_aux[l] = [j.strip() for j in i[np.where(aux >= 4)]]

In [151]:
line_aux

[['10/19 C23', '2,5 MI A 3 MI', '6,5 MI A 7 MI', '9 MI A 9,5 MI'],
 ['09/19 C23', '2,5 MI A 3 MI', '6,5 MI A 7 MI', '9,5 MI A 10 MI'],
 ['08/19 C22', '2 MI A 2,5 MI', '6,5 MI A 7 MI', '8,5 MI A 9 MI'],
 ['07/19 C21', '1,5 MI A 2 MI', '3 MI A 3,5 MI', '5 MI A 5,5 MI'],
 ['06/19 C21', '1,5 MI A 2 MI', '6 MI A 6,5 MI', '8 MI A 8,5 MI'],
 ['05/19 C22', '2 MI A 2,5 MI', '4 MI A 4,5 MI', '6 MI A 6,5 MI'],
 ['04/19 C21', '1,5 MI A 2 MI', '3 MI A 3,5 MI', '5 MI A 5,5 MI'],
 ['03/19 C21', '1,5 MI A 2 MI', '2 MI A 2,5 MI', '3,5 MI A 4 MI'],
 ['02/19 C20', '1 MI A 1,5 MI', '1,5 MI A 2 MI', '2,5 MI A 3 MI'],
 ['01/19 C20', '1 MI A 1,5 MI', '1,5 MI A 2 MI', '3 MI A 3,5 MI'],
 ['12/18 C19', '900 MIL A 1 MI', '3 MI A 3,5 MI', '4 MI A 4,5 MI'],
 ['11/18 C19', '900 MIL A 1 MI', '3,5 MI A 4 MI', '4,5 MI A 5 MI'],
 ['10/18 C19', '900 MIL A 1 MI', '2,5 MI A 3 MI', '3,5 MI A 4 MI'],
 ['09/18 C20', '1 MI A 1,5 MI', '2 MI A 2,5 MI', '3 MI A 3,5 MI'],
 ['TOTAL            D18', '50 MI A 70 MI']]

In [ ]:
import ..

In [28]:
_, df = search_table(name_type, split_space = '|', table_columns = ['MES/ANO','VENCIDOS','A VENCER','TOTAL'])
df

,MES/ANO,VENCIDOS,A VENCER,TOTAL
0,MES/ANO VENCIDOS A VENCER ...,NaN,NaN,NaN
1,10/19 C23,"2,5 MI A 3 MI",D6,"6,5 MI A 7 MI"
2,09/19 C23,"2,5 MI A 3 MI",D6,"6,5 MI A 7 MI"
3,08/19 C22,"2 MI A 2,5 MI",D6,"6,5 MI A 7 MI"
4,07/19 C21,"1,5 MI A 2 MI",C24,"3 MI A 3,5 MI"
5,06/19 C21,"1,5 MI A 2 MI",D5,"6 MI A 6,5 MI"
6,05/19 C22,"2 MI A 2,5 MI",D1,"4 MI A 4,5 MI"
7,04/19 C21,"1,5 MI A 2 MI",C24,"3 MI A 3,5 MI"
8,03/19 C21,"1,5 MI A 2 MI",C22,"2 MI A 2,5 MI"
9,02/19 C20,"1 MI A 1,5 MI",C21,"1,5 MI A 2 MI"
10,01/19 C20,"1 MI A 1,5 MI",C21,"1,5 MI A 2 MI"
11,12/18 C19,900 MIL A 1 MI,C24,"3 MI A 3,5 MI"
12,11/18 C19,900 MIL A 1 MI,C25,"3,5 MI A 4 MI"
13,10/18 C19,900 MIL A 1 MI,C23,"2,5 MI A 3 MI"
14,09/18 C20,"1 MI A 1,5 MI",C22,"2 MI A 2,5 MI"
15,TOTAL D18,50 MI A 70 MI,NaN,NaN

In [24]:
table_vector

array(['EVOLUCAO DE COMPROMISSOS - VISAO CEDENTE (VALORES EM R$)',
       '(ATUALIZACAO EM 04/10/2019)',
       'MES/ANO  VENCIDOS                A VENCER                TOTAL',
       '10/19 C23|2,5 MI A 3 MI      |D6 |6,5 MI A 7 MI       |D11|9 MI A 9,5 MI',
       '09/19 C23|2,5 MI A 3 MI      |D6 |6,5 MI A 7 MI       |D12|9,5 MI A 10 MI',
       '08/19 C22|2 MI A 2,5 MI      |D6 |6,5 MI A 7 MI       |D10|8,5 MI A 9 MI',
       '07/19 C21|1,5 MI A 2 MI      |C24|3 MI A 3,5 MI       |D3 |5 MI A 5,5 MI',
       '06/19 C21|1,5 MI A 2 MI      |D5 |6 MI A 6,5 MI       |D9 |8 MI A 8,5 MI',
       '05/19 C22|2 MI A 2,5 MI      |D1 |4 MI A 4,5 MI       |D5 |6 MI A 6,5 MI',
       '04/19 C21|1,5 MI A 2 MI      |C24|3 MI A 3,5 MI       |D3 |5 MI A 5,5 MI',
       '03/19 C21|1,5 MI A 2 MI      |C22|2 MI A 2,5 MI       |C25|3,5 MI A 4 MI',
       '02/19 C20|1 MI A 1,5 MI      |C21|1,5 MI A 2 MI       |C23|2,5 MI A 3 MI',
       '01/19 C20|1 MI A 1,5 MI      |C21|1,5 MI A 2 MI       |C24|3 MI A 3,5 MI',
       '12/18 C19|900 MIL A 1 MI     |C24|3 MI A 3,5 MI       |D1 |4 MI A 4,5 MI',
       '11/18 C19|900 MIL A 1 MI     |C25|3,5 MI A 4 MI       |D2 |4,5 MI A 5 MI',
       '10/18 C19|900 MIL A 1 MI     |C23|2,5 MI A 3 MI       |C25|3,5 MI A 4 MI',
       '09/18 C20|1 MI A 1,5 MI      |C22|2 MI A 2,5 MI       |C24|3 MI A 3,5 MI',
       'TOTAL            D18|50 MI A 70 MI       |'], dtype='<U79')

In [389]:
cpnj = text[text.find('CNPJ:'):].split('\n')[0]
cpnj = cpnj.replace('CNPJ:','').strip()

In [90]:
table_columns= ['PONTUAL_QTD','PONTUAL_%',
        '8-15_QTD','8-15_%',
        '16-30_QTD','16-30_%',
        '31-60_QTD','31-60_%',
        '+60_QTD','+60_%',
        'A VISTA_QTD']

a, df = search_table(name_type, \
                     table_columns = ['MES/ANO','VENCIDOS','A VENCER','TOTAL'],
                                split_space= '([..\|])', \
                                split_line =1)

In [91]:
df

                 MES/ANO              VENCIDOS A VENCER                 TOTAL
0              10/19 C23   2,5 MI A 3 MI            D6   6,5 MI A 7 MI
1              09/19 C23   2,5 MI A 3 MI            D6   6,5 MI A 7 MI
2              08/19 C22   2 MI A 2,5 MI            D6   6,5 MI A 7 MI
3              07/19 C21   1,5 MI A 2 MI            C24  3 MI A 3,5 MI
4              06/19 C21   1,5 MI A 2 MI            D5   6 MI A 6,5 MI
5              05/19 C22   2 MI A 2,5 MI            D1   4 MI A 4,5 MI
6              04/19 C21   1,5 MI A 2 MI            C24  3 MI A 3,5 MI
7              03/19 C21   1,5 MI A 2 MI            C22  2 MI A 2,5 MI
8              02/19 C20   1 MI A 1,5 MI            C21  1,5 MI A 2 MI
9              01/19 C20   1 MI A 1,5 MI            C21  1,5 MI A 2 MI
10             12/18 C19   900 MIL A 1 MI           C24  3 MI A 3,5 MI
11             11/18 C19   900 MIL A 1 MI           C25  3,5 MI A 4 MI
12             10/18 C19   900 MIL A 1 MI           C23  2,5 MI A 3 MI
13             09/18 C20   1 MI A 1,5 MI            C22  2 MI A 2,5 MI
14  TOTAL            D18  50 MI A 70 MI             NaN                   NaN

In [413]:
pendence_df

  TOTAL DE OCORRENCIAS VALOR TOTAL
0                    5   3.830.978

In [5]:
def search_pendence_table(name_type):
    vector_aux = text[text.find(name_type):].split('\n')
    vector_aux = np.array(vector_aux)

    table_vector = vector_aux[:np.where(vector_aux == '')[0][0]]
    
    #----------------------------------------------------------------
    total_occurrence = table_vector[1].split('=')[1].strip()
    total_value = table_vector[2].split('=')[1].strip()
    #----------------------------------------------------------------
    
    line_aux = table_vector[4:]
    line_aux = np.array(line_aux)
    line_aux = line_aux[line_aux!='']

    table_columns = line_aux[0].split('   ')
    table_columns = np.array(table_columns)
    table_columns= table_columns[table_columns!='']
    table_columns = [i.strip().replace(':','') for i in table_columns]
    
    line_aux = line_aux[1:]
    
    data = {i:[] for i in table_columns}


    for line in line_aux:
        line_1 = re.sub(' +', ' ', line)
        line_1 = line_1.split(' ')

        line_2 = np.array(line.split('  '))
        line_2 = line_2[line_2!='']

        data['DATA'].append(line_1[0])
        data['MODALIDADE'].append(' '.join(line_2[0].split(' ')[1:]))
        data['AVAL'].append(line_2[1].strip().split(' ')[0])
        value_c = line.split('R$')[1].strip().split(' ')[0]
        data['VALOR CONTRATO'].append(value_c)


        origem_vector = line.split(value_c)[1].strip()
        aux_origem = np.array(list(origem_vector))
        x = np.array([str.isnumeric(i) for i in aux_origem])
        i, = np.where(x == True)
        i = i.max()

        data['ORIGEM'].append(origem_vector[:i+1].strip())
        data['LOCAL'].append(origem_vector[i+1:].strip())
    
    return total_occurrence, total_value, pd.DataFrame(data)

In [198]:
def search_table(name:str,\
                table_columns:list = [],\
                split_line:int = 0,\
                split_space:str = '  ',\
                print_table:bool = False) -> (str, pd.DataFrame):
        
    vector_aux = text[text.find(name):].split('\n')
    vector_aux = np.array(vector_aux)

    table_vector = vector_aux[:np.where(vector_aux == '')[0][0]]

    table_name = table_vector[0].split('  ')[0].strip()

    if len(table_columns) == 0:
        table_columns = table_vector[1].split('  ')
        table_columns = np.array(table_columns)
        table_columns= table_columns[table_columns!='']
        table_columns = [i.strip().replace(':','') for i in table_columns]

    line_aux = table_vector[2+split_line:]
    line_aux = np.array(line_aux)
    line_aux = line_aux[line_aux!='']
    line_aux = [np.array(i.split(split_space)) for i in line_aux]
    line_aux = [i[i!=''] for i in line_aux]

    data = {i:[] for i in table_columns}
    for l in line_aux:
        for j in range(len(table_columns)):
            try:
                data[table_columns[j]].append(l[j])
            except:
                data[table_columns[j]].append(np.nan)
    df = pd.DataFrame(data)

    if print_table:
        print(table_name)
        display(df)

    return table_name, df

In [7]:
import json

In [6]:
_, df = search_table('RELACIONAMENTO COM O MERCADO')

In [7]:
type(json.loads(df.T.to_json()))

dict

In [103]:
df.columns

Index(['0-6 MESES', '6MES-1ANO', '1-3ANOS', '3-5ANOS', '5-10ANOS', '+10ANOS',
       'INAT.'],
      dtype='object')

In [106]:

re.sub(' +', ' ', 'RELACIONAMENTO COM -           FACTORINGS')

'RELACIONAMENTO COM - FACTORINGS'

In [6]:
search_table('RELACIONAMENTO COM -           FACTORINGS')

RELACIONAMENTO COM -

  0-6 MESES 6MES-1ANO 1-3ANOS 3-5ANOS 5-10ANOS +10ANOS INAT.
0        16        11       9       3       11       6     0

In [23]:
table_columns = ['MES_1', 'QTD_1', 'MES_2', 'QTD_2', 'CINCO_ULTIMAS_CONSULTAS', 'QTD']
name_table, df = search_table('REGISTRO DE CONSULTAS', table_columns = table_columns, split_line = 1)

In [28]:
df_1_aux = df[['MES_1', 'QTD_1']]
df_1_aux.columns = ['MES','QTD']
df_2_aux = df[['MES_2', 'QTD_2']]
df_2_aux.columns = ['MES','QTD']

df_1 = pd.concat([df_1_aux,df_2_aux])

In [82]:
df_2 = df[['CINCO_ULTIMAS_CONSULTAS', 'QTD']].iloc[:-1]

In [90]:
type(obj)

NameError: name 'obj' is not defined

In [83]:
def extract_date(line):
    aux_ = line.strip().split(' ')
    date = aux_[0]
    name = ' '.join(aux_[1:])
    return pd.Series({'DATA':pd.to_datetime(date, format = '%d/%m/%Y'), 
                       'CINCO_ULTIMAS_CONSULTAS':name.strip()})
    
df_2['DATA'] = '' 
df_2[['DATA','CINCO_ULTIMAS_CONSULTAS']] = df_2['CINCO_ULTIMAS_CONSULTAS'].apply(extract_date)

In [85]:
df_2.columns = ['EMPRESA', 'QTD','DATA']

In [86]:
df_2

                           EMPRESA QTD       DATA
0           D. C. SECCO & CIA LTDA   1 2015-04-14
1                      OPINIAO S/A   1 2015-04-13
2                           RED SA   1 2015-04-13
3  PLATINUM FOMENTO MERCANTIL LTDA   1 2015-04-10
4    G. FIN FOMENTO MERCANTIL LTDA   1 2015-04-09

In [27]:
df_1

,MES_1,QTD_1,MES_2,QTD_2,CINCO_ULTIMAS_CONSULTAS,QTD
0,MAR/15,31,AGO/14,17,14/04/2015 D. C. SECCO & CIA LTDA,1
1,FEV/15,28,JUL/14,12,13/04/2015 OPINIAO S/A,1
2,JAN/15,21,JUN/14,23,13/04/2015 RED SA,1
3,DEZ/14,24,MAI/14,32,10/04/2015 PLATINUM FOMENTO MERCANTIL LTDA,1
4,NOV/14,17,ABR/14,22,09/04/2015 G. FIN FOMENTO MERCANTIL LTDA,1
5,OUT/14,22,MAR/14,22,NaN,NaN

In [8]:
table_columns= ['PONTUAL_QTD','PONTUAL_%',
                '8-15_QTD','8-15_%',
                '16-30_QTD','16-30_%',
                '31-60_QTD','31-60_%',
                '+60_QTD','+60_%',
                'A VISTA_QTD']
search_table('HISTORICO DE PAGAMENTOS (QTDE DE TITULOS)', table_columns= table_columns, split_line =1)

HISTORICO DE PAGAMENTOS (QTDE DE TITULOS)

,PONTUAL_QTD,PONTUAL_%,8-15_QTD,8-15_%,16-30_QTD,16-30_%,31-60_QTD,31-60_%,+60_QTD,+60_%,A VISTA_QTD
0,1.390 100,0,0,0,0,0,0,0,0,1,NaN

In [9]:
table_columns= ['MES/ANO','PONTUAL_QTD','PONTUAL_%',
                '8-15_QTD','8-15_%',
                '16-30_QTD','16-30_%',
                '31-60_QTD','31-60_%',
                '+60_QTD','+60_%',
                'PMA A VISTA TOTAL','PMA A VISTA TOTAL_1','PMA A VISTA TOTAL_2']
search_table('HISTORICO DE PAGAMENTOS NO MERCADO (VALORES EM R$)', table_columns = table_columns, split_line = 1, split_space = ' ')

HISTORICO DE PAGAMENTOS NO MERCADO (VALORES EM R$)

,MES/ANO,PONTUAL_QTD,PONTUAL_%,8-15_QTD,8-15_%,16-30_QTD,16-30_%,31-60_QTD,31-60_%,+60_QTD,+60_%,PMA A VISTA TOTAL,PMA A VISTA TOTAL_1,PMA A VISTA TOTAL_2
0,ABR/15,40894,100,0,0,0,0,0,0,0,0,0,0,40894
1,MAR/15,180130,100,0,0,0,0,0,0,0,0,0,0,180130
2,FEV/15,222403,100,0,0,0,0,0,0,0,0,0,0,222403
3,JAN/15,180404,100,0,0,0,0,0,0,0,0,0,0,180404
4,DEZ/14,204476,100,0,0,0,0,0,0,0,0,0,0,204476
5,NOV/14,116716,100,0,0,0,0,0,0,0,0,0,0,116716
6,OUT/14,215249,100,0,0,0,0,0,0,0,0,0,0,215249
7,SET/14,339074,100,0,0,0,0,0,0,0,0,0,0,339074
8,AGO/14,194750,100,0,0,0,0,0,0,0,0,0,0,194750
9,JUL/14,235018,100,0,0,0,0,0,0,0,0,0,0,235018
10,JUN/14,148706,100,0,0,0,0,0,0,0,0,0,2980,151686
11,MAI/14,220720,100,0,0,0,0,0,0,0,0,0,0,220720
12,ABR/14,224486,100,0,0,0,0,0,0,0,0,0,0,224486
13,MAR/14,283754,100,0,0,0,0,0,0,0,0,0,0,283754
14,TOTAL,2806780,2980,2809760,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,MEDIA,200484,100,0,0,0,0,0,0,0,0,212,200697,NaN
16,*,PMA,=,PRAZO,MEDIO,DE,ATRASO,(EM,DIAS),NaN,NaN,NaN,NaN,NaN

In [88]:
table_columns= ['MES/ANO','PONTUAL_QTD','PONTUAL_%',
                '8-15_QTD','8-15_%',
                '16-30_QTD','16-30_%',
                '31-60_QTD','31-60_%',
                '+60_QTD','+60_%',
                'PMA A VISTA TOTAL','PMA A VISTA TOTAL_1','PMA A VISTA TOTAL_2']
_,df = search_table('HISTORICO DE PAGAMENTOS - FACTORINGS (VALORES EM R$)', table_columns = table_columns, split_line = 1, split_space = ' ')
df

,MES/ANO,PONTUAL_QTD,PONTUAL_%,8-15_QTD,8-15_%,16-30_QTD,16-30_%,31-60_QTD,31-60_%,+60_QTD,+60_%,PMA A VISTA TOTAL,PMA A VISTA TOTAL_1,PMA A VISTA TOTAL_2
0,MES/ANO,VALOR,%,VALOR,%,VALOR,%,VALOR,%,VALOR,%,(*),MES,NaN
1,ABR/15,40894,100,0,0,0,0,0,0,0,0,0,0,40894
2,MAR/15,83769,100,0,0,0,0,0,0,0,0,0,0,83769
3,FEV/15,185547,100,0,0,0,0,0,0,0,0,0,0,185547
4,JAN/15,131819,100,0,0,0,0,0,0,0,0,0,0,131819
5,DEZ/14,124776,100,0,0,0,0,0,0,0,0,0,0,124776
6,NOV/14,83223,100,0,0,0,0,0,0,0,0,0,0,83223
7,OUT/14,118992,100,0,0,0,0,0,0,0,0,0,0,118992
8,SET/14,207241,100,0,0,0,0,0,0,0,0,0,0,207241
9,AGO/14,160587,100,0,0,0,0,0,0,0,0,0,0,160587
10,JUL/14,120164,100,0,0,0,0,0,0,0,0,0,0,120164
11,JUN/14,74516,100,0,0,0,0,0,0,0,0,0,0,74516
12,MAI/14,73995,100,0,0,0,0,0,0,0,0,0,0,73995
13,ABR/14,87885,100,0,0,0,0,0,0,0,0,0,0,87885
14,MAR/14,29752,100,0,0,0,0,0,0,0,0,0,0,29752
15,TOTAL,1523160,1523160,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,MEDIA,108797,100,0,0,0,0,0,0,0,0,0,108797,NaN
17,*,PMA,=,PRAZO,MEDIO,DE,ATRASO,(EM,DIAS),NaN,NaN,NaN,NaN,NaN

In [200]:
table_columns= ['PONTUAL_MES/ANO',
                '8-15_QTD','8-15_%',
                '16-30_QTD','16-30_%',
                '31-60_QTD','31-60_%',
                '+60_QTD','+60_%',
                'PMA A VISTA TOTAL','PMA A VISTA TOTAL_1','PMA A VISTA TOTAL_2','PMA A VISTA TOTAL_3','PMA A VISTA TOTAL_4']
_, df = search_table('HISTORICO DE PAGAMENTOS - VISAO CEDENTE', table_columns = table_columns, split_line = 1, split_space = ' ')
df

,PONTUAL_MES/ANO,8-15_QTD,8-15_%,16-30_QTD,16-30_%,31-60_QTD,31-60_%,+60_QTD,+60_%,PMA A VISTA TOTAL,PMA A VISTA TOTAL_1,PMA A VISTA TOTAL_2,PMA A VISTA TOTAL_3,PMA A VISTA TOTAL_4
0,ABR/13,11,100,0,0,0,0,0,0,0,0,0,0,11
1,MAR/13,586,100,0,0,0,0,0,0,0,0,0,0,586
2,FEV/13,673,99,3,1,0,0,0,0,0,0,0,0,676
3,JAN/13,676,100,0,0,0,0,0,0,0,0,0,12,688
4,DEZ/12,590,100,0,0,0,0,0,0,0,0,0,178,768
5,NOV/12,633,89,78,11,0,0,0,0,0,0,1,60,771
6,OUT/12,602,100,0,0,0,0,0,0,0,0,0,0,602
7,SET/12,523,51,503,49,0,0,0,0,0,0,5,0,1026
8,AGO/12,566,100,0,0,0,0,0,0,0,0,0,0,566
9,JUL/12,31,100,0,0,0,0,0,0,0,0,0,0,31
10,TOTAL,4891,584,250,5725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,MEDIA,489,89,58,11,0,0,0,0,0,0,25,573,NaN
12,*,PMA,=,PRAZO,MEDIO,DE,ATRASO,(EM,DIAS),NaN,NaN,NaN,NaN,NaN

In [12]:
search_table('EVOLUCAO DE COMPROMISSOS NO MERCADO (VALORES EM R$)')

EVOLUCAO DE COMPROMISSOS NO MERCADO (VALORES EM R$)

   MES/ANO A VENCER
0   ABR/15  277.561
1   MAR/15  276.190
2   FEV/15  274.168
3   JAN/15  330.590
4   DEZ/14  243.762
5   NOV/14  253.957
6   OUT/14  282.092
7   SET/14  394.910
8   AGO/14  537.262
9   JUL/14  353.104
10  JUN/14  351.380
11  MAI/14  326.594
12  ABR/14  302.702
13  MAR/14  312.978

In [13]:
search_table('EVOLUCAO DE COMPROMISSOS - FACTORINGS (VALORES EM R$)', split_line = 1, table_columns = ['MES/ANO', 'A VENCER'])

EVOLUCAO DE COMPROMISSOS - FACTORINGS (VALORES EM R$) SACADO

   MES/ANO A VENCER
0   ABR/15  277.561
1   MAR/15  238.724
2   FEV/15  206.899
3   JAN/15  265.386
4   DEZ/14  202.595
5   NOV/14  161.063
6   OUT/14  224.798
7   SET/14  292.615
8   AGO/14  370.235
9   JUL/14  236.064
10  JUN/14  249.113
11  MAI/14  199.653
12  ABR/14  147.296
13  MAR/14  161.077

In [14]:
search_table('EVOLUCAO DE COMPROMISSOS - VISAO CEDENTE (VALORES EM R$)')

EVOLUCAO DE COMPROMISSOS - VISAO CEDENTE (VALORES EM R$)

   MES/ANO VENCIDOS  A VENCER      TOTAL
0   ABR/15  640.383     3.810    644.193
1   MAR/15  637.528     6.665    644.193
2   FEV/15  245.681   398.512    644.193
3   JAN/15        0   644.194    644.194
4   DEZ/14        0   520.128    520.128
5   NOV/14        0   523.139    523.139
6   AGO/14        0   637.109    637.109
7   JUL/14        0  1867.164  1.867.164
8   JUN/14        0  2260.472  2.260.472
9   MAI/14        0   331.895    331.895
10  ABR/14        0  1922.186  1.922.186
11  MAR/14        0  1726.087  1.726.087

In [15]:
search_table('REFERENCIAIS DE NEGOCIOS NO MERCADO (VALORES EM R$)', split_space = '    ')

REFERENCIAIS DE NEGOCIOS NO MERCADO (VALORES EM R$)

                       DATA      VALOR     MEDIA
0  ULTIMA COMPRA 10/04/2015     17.524     4.391
1  MAIOR FATURA  19/08/2014     81.215    14.832
2  MAIOR ACUMULO 07/03/2014    283.021    35.543

In [ ]:
name:str,
table_columns:list,
split_line:int,
split_space:str,
print_table:bool

In [16]:
search_table('REFERENCIAIS DE NEGOCIOS A PRAZO - FACTORINGS (VALORES EM R$)', split_space = '    ', split_line = 1, table_columns = ['DATA', 'VALOR', 'MEDIA'])

REFERENCIAIS DE NEGOCIOS A PRAZO - FACTORINGS (VALORES EM R$) SACADO

                       DATA      VALOR     MEDIA
0  ULTIMA COMPRA 10/04/2015     17.524     6.320
1  MAIOR FATURA  19/08/2014     81.215    20.093
2  MAIOR ACUMULO 19/01/2015    163.233    44.186

In [11]:
_, df = search_table('OCORRENCIAS MAIS RECENTES (ATE 05)', table_columns = ['DATA','AVAL','VALOR CONTRATO','ORIGEM','LOCAL'])
df

,DATA,AVAL,VALOR CONTRATO,ORIGEM,LOCAL
0,20/03/2010 OPER.CAMBIO,N,R$,426.172 CCL 09/39,BANCO DA AMAZONI
1,17/03/2010 OPER.CAMBIO,N,R$,477.000 CCL 09/38,BANCO DA AMAZONI
2,12/03/2010 OPER.CAMBIO,N,R$,475.530 CCL 09/36,BANCO DA AMAZONI
3,17/02/2010 OPER.CAMBIO,N,R$,609.076 CCL09037,BANCO DA AMAZONI
4,03/02/2010 OPER.CAMBIO,N,R$ 1.843.200 CCL 09/016,BANCO DA AMAZONI,NaN

In [151]:
new_text = text[text.find('PENDENCIA:REFIN'):]

In [156]:
line_aux = line_aux[1:]

In [157]:
line_aux

array(['20/03/2010 OPER.CAMBIO   N  R$   426.172 CCL 09/39        BANCO DA AMAZONI',
       '17/03/2010 OPER.CAMBIO   N  R$   477.000 CCL 09/38        BANCO DA AMAZONI',
       '12/03/2010 OPER.CAMBIO   N  R$   475.530 CCL 09/36        BANCO DA AMAZONI',
       '17/02/2010 OPER.CAMBIO   N  R$   609.076 CCL09037         BANCO DA AMAZONI',
       '03/02/2010 OPER.CAMBIO   N  R$ 1.843.200 CCL 09/016       BANCO DA AMAZONI'],
      dtype='<U79')

In [158]:
table_columns

['DATA', 'MODALIDADE', 'AVAL', 'VALOR CONTRATO', 'ORIGEM', 'LOCAL']

In [161]:
pd.DataFrame(data)

         DATA   MODALIDADE AVAL VALOR CONTRATO      ORIGEM              LOCAL
0  20/03/2010  OPER.CAMBIO    N        426.172   CCL 09/39   BANCO DA AMAZONI
1  17/03/2010  OPER.CAMBIO    N        477.000   CCL 09/38   BANCO DA AMAZONI
2  12/03/2010  OPER.CAMBIO    N        475.530   CCL 09/36   BANCO DA AMAZONI
3  17/02/2010  OPER.CAMBIO    N        609.076    CCL09037   BANCO DA AMAZONI
4  03/02/2010  OPER.CAMBIO    N      1.843.200  CCL 09/016   BANCO DA AMAZONI